meeting/agenda/2025/10-07.org
:PROPERTIES:
:ID:       065B41A7-15D7-47A0-B480-F42AD1037309
:END:
#+title: QT4 CG Meeting 137 Agenda 2025-10-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

Heads up: daylight saving time ends in the UK and Europe on 26 October 2025. It
ends in the United States on 2 November 2025. Our meetings are scheduled on
European civil time, consequently, our meeting of 29 October 2025 will occur one
hour *later* in the United States at 12:00EDT.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/09-30.html][the previous meeting]]. (With minor corrections on 2 October.)

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 7 October 2025.

The next meeting is planned for 14 October 2025.

** Review of open action items [4/9]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [X] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [ ] QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps
+ [ ] QT4CG-131-01: MK to add a non-schema aware result.
+ [ ] QT4CG-131-02: MK to expand on the ~$E := <e A="p q r"…~ example
+ [X] QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.
+ [X] QT4CG-133-01: MK to correct the use of “Expr” in examples for get()
+ [X] QT4CG-135-01: MK to correct attribute rule 5/d to use the schema component name

See [[https://lists.w3.org/Archives/Public/public-xslt-40/2025Oct/0000.html][email]] for a discussion of the disposition of some of these items.

** Preparing for public releases
:PROPERTIES:
:CUSTOM_ID: stable-drafts
:END:

We currently post “latest draft” publications, which change with every accepted
PR, and PR drafts which expire and get deleted after a month or so. As things
become more stable, should we consider publishing stable, dated drafts?

+ Update the status sections to indicate immutable status
+ Publish them to a dated URI space, e.g. ~/specifications/2025-11-04/...~
+ Link to (at least the most recent) dated versions from the homepage

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2220][#2220]]: QT4CG-131-02 Expand on existing example for deconstructed variable bindings

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1787][#1787]]: Sorted maps revisited
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1153][#1153]]: XSLT: debugging template rule selection
+ Issue [[https://github.com/qt4cg/qtspecs/issues/75][#75]]: Support processing HTML 5 template element content

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.
(Note that the proposed discussion order is different.)

+ PR [[https://qt4cg.org/dashboard/#pr-2232][#2232]]: 1935 Errors from doc-available
+ PR [[https://qt4cg.org/dashboard/#pr-2231][#2231]]: Updated status section for all documents
+ PR [[https://qt4cg.org/dashboard/#pr-2230][#2230]]: 2229 Drop map:keys-where()
+ PR [[https://qt4cg.org/dashboard/#pr-2228][#2228]]: 2012 Define array:sort-with, revise fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-2227][#2227]]: 2079 Allow optional prefix in EQName syntax
+ PR [[https://qt4cg.org/dashboard/#pr-2226][#2226]]: 2186 Change adaptive serialization of JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2225][#2225]]: 1718 Ordered Maps: positions in callback functions
+ PR [[https://qt4cg.org/dashboard/#pr-2224][#2224]]: 2148 fn:base-uri: Raise error
+ PR [[https://qt4cg.org/dashboard/#pr-2223][#2223]]: 2193 fn:parse-xml, fn:doc: Drop security options
+ PR [[https://qt4cg.org/dashboard/#pr-2222][#2222]]: 2217 bin:decode-string: Input encoding
+ PR [[https://qt4cg.org/dashboard/#pr-2218][#2218]]: 986 Numeric Comparisons
+ PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]: 2047 External resources and security
+ PR [[https://qt4cg.org/dashboard/#pr-2208][#2208]]: 675 (part) Update XSLT streamability rules
+ PR [[https://qt4cg.org/dashboard/#pr-2205][#2205]]: 2190 Drop binary input for parse-csv and parse-json
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2231: Updated status section for all documents
:PROPERTIES:
:CUSTOM_ID: pr-2231
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2231][#2231]]
** PR #2213: 2047 External resources and security
:PROPERTIES:
:CUSTOM_ID: pr-2213
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2213][#2213]]
** PR #2160: 2073 data model changes for JNodes and Sequences
:PROPERTIES:
:CUSTOM_ID: pr-2160
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]
** PR #2120: 2007 Revised design for xsl:array
:PROPERTIES:
:CUSTOM_ID: pr-2120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]
** PR #2232: 1935 Errors from doc-available
:PROPERTIES:
:CUSTOM_ID: pr-2232
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2232][#2232]]
** PR #2222: 2217 bin:decode-string: Input encoding
:PROPERTIES:
:CUSTOM_ID: pr-2222
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2222][#2222]]
** PR #2230: 2229 Drop map:keys-where()
:PROPERTIES:
:CUSTOM_ID: pr-2230
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2230][#2230]]
** PR #2228: 2012 Define array:sort-with, revise fn:sort-with
:PROPERTIES:
:CUSTOM_ID: pr-2228
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2228][#2228]]
** PR #2227: 2079 Allow optional prefix in EQName syntax
:PROPERTIES:
:CUSTOM_ID: pr-2227
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2227][#2227]]
** PR #2226: 2186 Change adaptive serialization of JNodes
:PROPERTIES:
:CUSTOM_ID: pr-2226
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2226][#2226]]
** PR #2225: 1718 Ordered Maps: positions in callback functions
:PROPERTIES:
:CUSTOM_ID: pr-2225
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2225][#2225]]
** PR #2224: 2148 fn:base-uri: Raise error
:PROPERTIES:
:CUSTOM_ID: pr-2224
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2224][#2224]]
** PR #2223: 2193 fn:parse-xml, fn:doc: Drop security options
:PROPERTIES:
:CUSTOM_ID: pr-2223
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2223][#2223]]
** PR #2218: 986 Numeric Comparisons
:PROPERTIES:
:CUSTOM_ID: pr-2218
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2218][#2218]]
** PR #2071: 77c deep update
:PROPERTIES:
:CUSTOM_ID: pr-2071
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]


* Update on QT4 presentation at Declarative Amsterdam
:PROPERTIES:
:CUSTOM_ID: declarative-amsterdam
:END:

JWL and JLO are giving a tutorial about changes coming in QT4 at the Declarative
Amsterdam conference on Thursday afternoon, 6 November 2025. They’ll give us
a short preview of what they plan to present.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
