meeting/agenda/2025/10-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 137 Agenda 2025-10-07</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 137 Agenda 2025-10-07</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>

<p>
Heads up: daylight saving time ends in the UK and Europe on 26 October 2025. It
ends in the United States on 2 November 2025. Our meetings are scheduled on
European civil time, consequently, our meeting of 29 October 2025 will occur one
hour <b>later</b> in the United States at 12:00EDT.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/09-30.html">the previous meeting</a>. (With minor corrections on 2 October.)
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 7 October 2025.
</p>

<p>
The next meeting is planned for 14 October 2025.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[4/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="on"><code>[X]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-01: MK to add a non-schema aware result.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-131-02: MK to expand on the <code>$E := &lt;e A="p q r"…</code> example</li>
<li class="on"><code>[X]</code> QT4CG-131-03: MK to change “invert” to “transpose” in the matrix example.</li>
<li class="on"><code>[X]</code> QT4CG-133-01: MK to correct the use of “Expr” in examples for get()</li>
<li class="on"><code>[X]</code> QT4CG-135-01: MK to correct attribute rule 5/d to use the schema component name</li>
</ul>

<p>
See <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2025Oct/0000.html">email</a> for a discussion of the disposition of some of these items.
</p>
</div>
</div>
<div id="outline-container-stable-drafts" class="outline-3">
<h3 id="stable-drafts"><span class="section-number-3">1.6.</span> Preparing for public releases</h3>
<div class="outline-text-3" id="text-stable-drafts">
<p>
We currently post “latest draft” publications, which change with every accepted
PR, and PR drafts which expire and get deleted after a month or so. As things
become more stable, should we consider publishing stable, dated drafts?
</p>

<ul class="org-ul">
<li>Update the status sections to indicate immutable status</li>
<li>Publish them to a dated URI space, e.g. <code>/specifications/2025-11-04/...</code></li>
<li>Link to (at least the most recent) dated versions from the homepage</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.7.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.7.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.7.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2220">#2220</a>: QT4CG-131-02 Expand on existing example for deconstructed variable bindings</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.7.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1787">#1787</a>: Sorted maps revisited</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1153">#1153</a>: XSLT: debugging template rule selection</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/75">#75</a>: Support processing HTML 5 template element content</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.7.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
(Note that the proposed discussion order is different.)
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2232">#2232</a>: 1935 Errors from doc-available</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2231">#2231</a>: Updated status section for all documents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2230">#2230</a>: 2229 Drop map:keys-where()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2228">#2228</a>: 2012 Define array:sort-with, revise fn:sort-with</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2227">#2227</a>: 2079 Allow optional prefix in EQName syntax</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2226">#2226</a>: 2186 Change adaptive serialization of JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2225">#2225</a>: 1718 Ordered Maps: positions in callback functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2224">#2224</a>: 2148 fn:base-uri: Raise error</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>: 2193 fn:parse-xml, fn:doc: Drop security options</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2222">#2222</a>: 2217 bin:decode-string: Input encoding</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2218">#2218</a>: 986 Numeric Comparisons</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>: 2047 External resources and security</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2208">#2208</a>: 675 (part) Update XSLT streamability rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2205">#2205</a>: 2190 Drop binary input for parse-csv and parse-json</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.7.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/986">#986</a>: Numeric Comparisons</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2231" class="outline-3">
<h3 id="pr-2231"><span class="section-number-3">2.1.</span> PR #2231: Updated status section for all documents</h3>
<div class="outline-text-3" id="text-pr-2231">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2231">#2231</a>
</p>
</div>
</div>
<div id="outline-container-pr-2213" class="outline-3">
<h3 id="pr-2213"><span class="section-number-3">2.2.</span> PR #2213: 2047 External resources and security</h3>
<div class="outline-text-3" id="text-pr-2213">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>
</p>
</div>
</div>
<div id="outline-container-pr-2160" class="outline-3">
<h3 id="pr-2160"><span class="section-number-3">2.3.</span> PR #2160: 2073 data model changes for JNodes and Sequences</h3>
<div class="outline-text-3" id="text-pr-2160">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>
</p>
</div>
</div>
<div id="outline-container-pr-2120" class="outline-3">
<h3 id="pr-2120"><span class="section-number-3">2.4.</span> PR #2120: 2007 Revised design for xsl:array</h3>
<div class="outline-text-3" id="text-pr-2120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>
</p>
</div>
</div>
<div id="outline-container-pr-2232" class="outline-3">
<h3 id="pr-2232"><span class="section-number-3">2.5.</span> PR #2232: 1935 Errors from doc-available</h3>
<div class="outline-text-3" id="text-pr-2232">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2232">#2232</a>
</p>
</div>
</div>
<div id="outline-container-pr-2222" class="outline-3">
<h3 id="pr-2222"><span class="section-number-3">2.6.</span> PR #2222: 2217 bin:decode-string: Input encoding</h3>
<div class="outline-text-3" id="text-pr-2222">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2222">#2222</a>
</p>
</div>
</div>
<div id="outline-container-pr-2230" class="outline-3">
<h3 id="pr-2230"><span class="section-number-3">2.7.</span> PR #2230: 2229 Drop map:keys-where()</h3>
<div class="outline-text-3" id="text-pr-2230">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2230">#2230</a>
</p>
</div>
</div>
<div id="outline-container-pr-2228" class="outline-3">
<h3 id="pr-2228"><span class="section-number-3">2.8.</span> PR #2228: 2012 Define array:sort-with, revise fn:sort-with</h3>
<div class="outline-text-3" id="text-pr-2228">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2228">#2228</a>
</p>
</div>
</div>
<div id="outline-container-pr-2227" class="outline-3">
<h3 id="pr-2227"><span class="section-number-3">2.9.</span> PR #2227: 2079 Allow optional prefix in EQName syntax</h3>
<div class="outline-text-3" id="text-pr-2227">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2227">#2227</a>
</p>
</div>
</div>
<div id="outline-container-pr-2226" class="outline-3">
<h3 id="pr-2226"><span class="section-number-3">2.10.</span> PR #2226: 2186 Change adaptive serialization of JNodes</h3>
<div class="outline-text-3" id="text-pr-2226">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2226">#2226</a>
</p>
</div>
</div>
<div id="outline-container-pr-2225" class="outline-3">
<h3 id="pr-2225"><span class="section-number-3">2.11.</span> PR #2225: 1718 Ordered Maps: positions in callback functions</h3>
<div class="outline-text-3" id="text-pr-2225">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2225">#2225</a>
</p>
</div>
</div>
<div id="outline-container-pr-2224" class="outline-3">
<h3 id="pr-2224"><span class="section-number-3">2.12.</span> PR #2224: 2148 fn:base-uri: Raise error</h3>
<div class="outline-text-3" id="text-pr-2224">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2224">#2224</a>
</p>
</div>
</div>
<div id="outline-container-pr-2223" class="outline-3">
<h3 id="pr-2223"><span class="section-number-3">2.13.</span> PR #2223: 2193 fn:parse-xml, fn:doc: Drop security options</h3>
<div class="outline-text-3" id="text-pr-2223">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>
</p>
</div>
</div>
<div id="outline-container-pr-2218" class="outline-3">
<h3 id="pr-2218"><span class="section-number-3">2.14.</span> PR #2218: 986 Numeric Comparisons</h3>
<div class="outline-text-3" id="text-pr-2218">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2218">#2218</a>
</p>
</div>
</div>
<div id="outline-container-pr-2071" class="outline-3">
<h3 id="pr-2071"><span class="section-number-3">2.15.</span> PR #2071: 77c deep update</h3>
<div class="outline-text-3" id="text-pr-2071">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.16.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>
</p>
</div>
</div>
</div>
<div id="outline-container-declarative-amsterdam" class="outline-2">
<h2 id="declarative-amsterdam"><span class="section-number-2">3.</span> Update on QT4 presentation at Declarative Amsterdam</h2>
<div class="outline-text-2" id="text-declarative-amsterdam">
<p>
JWL and JLO are giving a tutorial about changes coming in QT4 at the Declarative
Amsterdam conference on Thursday afternoon, 6 November 2025. They’ll give us
a short preview of what they plan to present.
</p>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">4.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
